Revit 2027 API
DataConversionMonitorScope Constructor
 The only constructor. Expects a valid pointer to IDataConversionMonitor.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DataConversionMonitorScope(
	IDataConversionMonitor IDCM
)
Public Sub New (
	IDCM As IDataConversionMonitor
)
public:
DataConversionMonitorScope(
	IDataConversionMonitor^ IDCM
)
new :
        IDCM : IDataConversionMonitor -> DataConversionMonitorScope
Parameters
IDCM IDataConversionMonitor
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DataConversionMonitorScope Class
Autodesk.Revit.DB Namespace